Repository: guilamu/distillpress
Catalog: languages/distillpress-*.po
Languages: fr_fr

source: Processing...
fr_fr: Traitement en cours...

source: Generating summary...
fr_fr: Génération du résumé...

source: Generating teaser...
fr_fr: Génération de l'accroche...

source: Generating summary and teaser...
fr_fr: Génération du résumé et de l'accroche...

source: Finding categories...
fr_fr: Recherche des catégories...

source: An error occurred
fr_fr: Une erreur s'est produite

source: Success!
fr_fr: Succès !

source: Summary generated successfully!
fr_fr: Résumé généré avec succès !

source: Teaser generated successfully!
fr_fr: Accroche générée avec succès !

source: Summary and teaser generated successfully!
fr_fr: Résumé et accroche générés avec succès !

source: Categories selected successfully!
fr_fr: Catégories sélectionnées avec succès !

source: Please add content to your post first.
fr_fr: Veuillez d'abord ajouter du contenu à votre article.

source: No matching categories found.
fr_fr: Aucune catégorie correspondante trouvée.

source: Copy summary
fr_fr: Copier le résumé

source: Copy teaser
fr_fr: Copier l'accroche

source: No teaser generated.
fr_fr: Aucune accroche générée.

source: No summary generated.
fr_fr: Aucun résumé généré.

source: Copied!
fr_fr: Copié !

source: Settings
fr_fr: Réglages

source: Permission denied.
fr_fr: Permission refusée.

source: No content provided.
fr_fr: Aucun contenu fourni.

source: Both summary and teaser are disabled in settings.
fr_fr: Le résumé et l'accroche sont tous deux désactivés dans les réglages.

source: API key not configured. Please go to Settings > DistillPress.
fr_fr: Clé API non configurée. Veuillez aller dans Réglages > DistillPress.

source: You are a precise summarization assistant. Your task is to create factual content based EXCLUSIVELY on the provided text. You must:
fr_fr: Vous êtes un assistant de synthèse précis. Votre tâche est de créer du contenu factuel basé EXCLUSIVEMENT sur le texte fourni. Vous devez :

source: 1. ONLY use information explicitly stated in the source text
fr_fr: 1. Utiliser UNIQUEMENT les informations explicitement mentionnées dans le texte source

source: 2. NEVER add interpretations, opinions, or external knowledge
fr_fr: 2. Ne JAMAIS ajouter d'interprétations, d'opinions ou de connaissances externes

source: 3. NEVER hallucinate or invent information not present in the text
fr_fr: 3. Ne JAMAIS inventer ou halluciner des informations non présentes dans le texte

source: 4. Use neutral, objective language for the summary
fr_fr: 4. Utiliser un langage neutre et objectif pour le résumé

source: 5. Make the teaser engaging but still factual
fr_fr: 5. Rendre l'accroche attrayante tout en restant factuelle

source: 6. Preserve the original meaning accurately
fr_fr: 6. Préserver fidèlement le sens original

source: 7. Respond in the SAME LANGUAGE as the source text
fr_fr: 7. Répondre dans la MÊME LANGUE que le texte source

source: 8. Return your response in JSON format with "summary" and "teaser" fields
fr_fr: 8. Retourner votre réponse au format JSON avec les champs "summary" et "teaser"

source: 8. Return your response in JSON format with "summary" field
fr_fr: 8. Retourner votre réponse au format JSON avec le champ "summary"

source: 8. Return your response in JSON format with "teaser" field
fr_fr: 8. Retourner votre réponse au format JSON avec le champ "teaser"

source: Analyze the following article and provide both a summary and a teaser.
fr_fr: Analysez l'article suivant et fournissez à la fois un résumé et une accroche.

source: Analyze the following article and provide a summary.
fr_fr: Analysez l'article suivant et fournissez un résumé.

source: Analyze the following article and provide a teaser.
fr_fr: Analysez l'article suivant et fournissez une accroche.

source: SUMMARY: Create exactly %d key bullet points.
fr_fr: RÉSUMÉ : Créer exactement %d points clés.

source: The total summary must not exceed %1$d characters (approximately %2$d characters per point).
fr_fr: Le résumé total ne doit pas dépasser %1$d caractères (environ %2$d caractères par point).

source: - Each point must be a complete, standalone statement
fr_fr: - Chaque point doit être une déclaration complète et autonome

source: - Start each point with a bullet (•)
fr_fr: - Commencer chaque point par une puce (•)

source: - Focus on the most important and factual information
fr_fr: - Se concentrer sur les informations les plus importantes et factuelles

source: TEASER: Write a short, engaging paragraph (2-3 sentences) that entices readers to read the full article. The teaser should:
fr_fr: ACCROCHE : Écrivez un court paragraphe attrayant (2-3 phrases) qui incite les lecteurs à lire l'article complet. L'accroche doit :

source: - Highlight the most compelling aspect of the article
fr_fr: - Mettre en avant l'aspect le plus captivant de l'article

source: - Create curiosity without revealing everything
fr_fr: - Créer de la curiosité sans tout révéler

source: - Stay factual and based only on the article content
fr_fr: - Rester factuel et basé uniquement sur le contenu de l'article

source: Return ONLY valid JSON in this exact format:
fr_fr: Retourner UNIQUEMENT du JSON valide dans ce format exact :

source: Source text:
fr_fr: Texte source :

source: Additional instructions:
fr_fr: Instructions supplémentaires :

source: You are a content categorization assistant. Your task is to analyze text and select the most relevant categories from a predefined list. You must:
fr_fr: Vous êtes un assistant de catégorisation de contenu. Votre tâche est d'analyser le texte et de sélectionner les catégories les plus pertinentes dans une liste prédéfinie. Vous devez :

source: 1. ONLY select categories from the provided list
fr_fr: 1. Sélectionner UNIQUEMENT des catégories de la liste fournie

source: 2. Choose categories based on the actual content, not assumptions
fr_fr: 2. Choisir les catégories en fonction du contenu réel, pas des suppositions

source: 3. Return ONLY a JSON array of category names, nothing else
fr_fr: 3. Retourner UNIQUEMENT un tableau JSON de noms de catégories, rien d'autre

source: 4. If no categories match, return an empty array []
fr_fr: 4. Si aucune catégorie ne correspond, retourner un tableau vide []

source: 5. Order categories by relevance (most relevant first)
fr_fr: 5. Ordonner les catégories par pertinence (la plus pertinente en premier)

source: Select up to %1$d most relevant categories for the following content from this list: %2$s
fr_fr: Sélectionnez jusqu'à %1$d catégories les plus pertinentes pour le contenu suivant dans cette liste : %2$s

source: Return ONLY a JSON array of category names. Example: ["Category1", "Category2"]
fr_fr: Retourner UNIQUEMENT un tableau JSON de noms de catégories. Exemple : ["Catégorie1", "Catégorie2"]

source: Content to categorize:
fr_fr: Contenu à catégoriser :

source: No categories available.
fr_fr: Aucune catégorie disponible.

source: Failed to parse category response.
fr_fr: Échec de l'analyse de la réponse de catégorie.

source: Please enter your API key first.
fr_fr: Veuillez d'abord entrer votre clé API.

source: Gemini API key is required
fr_fr: La clé API Gemini est requise

source: Gemini API returned status %d
fr_fr: L'API Gemini a renvoyé l'erreur %d

source: Invalid Gemini API response
fr_fr: Réponse API Gemini invalide

source: API key is required
fr_fr: La clé API est requise

source: API returned status %d
fr_fr: L'API a renvoyé l'erreur %d

source: Failed to parse API response
fr_fr: Échec de l'analyse de la réponse API

source: Invalid API response
fr_fr: Réponse API invalide

source: Unable to rename the update folder. Please retry or update manually.
fr_fr: Impossible de renommer le dossier de mise à jour. Veuillez réessayer ou mettre à jour manuellement.

source: DistillPress Settings
fr_fr: Réglages DistillPress

source: API Settings
fr_fr: Réglages de l'API

source: API Provider
fr_fr: Fournisseur d'API

source: POE API Key
fr_fr: Clé API POE

source: Gemini API Key
fr_fr: Clé API Gemini

source: POE Model
fr_fr: Modèle POE

source: Gemini Model
fr_fr: Modèle Gemini

source: Summary Settings
fr_fr: Réglages du résumé

source: Default Number of Points
fr_fr: Nombre de points par défaut

source: Default Reduction Percentage
fr_fr: Pourcentage de réduction par défaut

source: Enable Summary
fr_fr: Activer le résumé

source: Generate bullet point summaries
fr_fr: Générer le résumé

source: Enable Teaser
fr_fr: Activer l'accroche

source: Generate teaser paragraphs
fr_fr: Générer l'accroche

source: Custom Instructions
fr_fr: Instructions personnalisées

source: Category Settings
fr_fr: Réglages des catégories

source: Default Max Categories
fr_fr: Maximum de catégories par défaut

source: Save Settings
fr_fr: Enregistrer les réglages

source: Your POE API key is defined in wp-config.php using the %s constant.
fr_fr: Votre clé API POE est définie dans wp-config.php à l'aide de la constante %s.

source: Your Gemini API key is defined in wp-config.php using the %s constant.
fr_fr: Votre clé API Gemini est définie dans wp-config.php à l'aide de la constante %s.

source: Choose your AI provider and configure the connection settings.
fr_fr: Choisissez votre fournisseur d'IA et configurez les paramètres de connexion.

source: Select which AI provider to use for generating summaries and categories.
fr_fr: Sélectionnez le fournisseur d'IA à utiliser pour générer les résumés et les catégories.

source: Configure default settings for article summarization.
fr_fr: Configurez les paramètres par défaut pour le résumé d'articles.

source: Configure default settings for automatic category selection.
fr_fr: Configurez les paramètres par défaut pour la sélection automatique des catégories.

source: API key is defined in wp-config.php and cannot be changed here.
fr_fr: La clé API est définie dans wp-config.php et ne peut pas être modifiée ici.

source: Show
fr_fr: Afficher

source: Enter your POE API key. Get it from poe.com → Settings → API.
fr_fr: Entrez votre clé API POE. Obtenez-la sur poe.com → Réglages → API.

source: Gemini API key is defined in wp-config.php and cannot be changed here.
fr_fr: La clé API Gemini est définie dans wp-config.php et ne peut pas être modifiée ici.

source: Enter your Gemini API key. Get it at %s.
fr_fr: Entrez votre clé API Gemini. Obtenez-la sur %s.

source: Enter API key first
fr_fr: Entrez d'abord la clé API

source: Refresh Models
fr_fr: Actualiser les modèles

source: Select the AI model to use. Click "Refresh Models" to load available models from POE.
fr_fr: Sélectionnez le modèle IA à utiliser. Cliquez sur « Actualiser les modèles » pour charger les modèles disponibles depuis POE.

source: Select the Gemini model to use. Flash is faster and cheaper; Pro is more capable.
fr_fr: Sélectionnez le modèle Gemini à utiliser. Flash est plus rapide et moins cher ; Pro est plus performant.

source: Default number of bullet points for the summary (1-20).
fr_fr: Nombre de puces par défaut pour le résumé (1-20).

source: Target summary length as a percentage of the original content. Set to 0 to disable this constraint.
fr_fr: Longueur cible du résumé en pourcentage du contenu original. Mettez 0 pour désactiver cette contrainte.

source: Example: If set to 10% and the article has 1000 characters, the summary will be limited to ~100 characters.
fr_fr: Exemple : Si réglé à 10% et que l'article a 1000 caractères, le résumé sera limité à ~100 caractères.

source: Maximum number of categories to auto-select (1-20).
fr_fr: Nombre maximum de catégories à sélectionner automatiquement (1-20).

source: Default Category
fr_fr: Catégorie par défaut

source: None
fr_fr: Aucune

source: This category will always be applied in addition to AI-selected categories.
fr_fr: Cette catégorie sera toujours appliquée en plus des catégories sélectionnées par l'IA.

source: Example: Always mention the author name. Use a formal tone.
fr_fr: Exemple : Toujours mentionner le nom de l'auteur. Utiliser un ton formel.

source: Add custom instructions to the AI prompt (1-2 sentences). These will be appended to the system prompt.
fr_fr: Ajoutez des instructions personnalisées au prompt IA (1-2 phrases). Celles-ci seront ajoutées au prompt système.

source: API Request Log (Last 10)
fr_fr: Journal des requêtes API (10 dernières)

source: No API requests logged yet.
fr_fr: Aucune requête API enregistrée.

source: Date/Time
fr_fr: Date/Heure

source: Model
fr_fr: Modèle

source: Tokens
fr_fr: Jetons

source: N/A
fr_fr: N/D

source: Summary & Teaser
fr_fr: Résumé et accroche

source: Generate Summary & Teaser
fr_fr: Générer le résumé et l'accroche

source: Regenerate Summary & Teaser
fr_fr: Régénérer le résumé et l'accroche

source: Generate Summary
fr_fr: Générer le résumé

source: Regenerate Summary
fr_fr: Régénérer le résumé

source: Generate Teaser
fr_fr: Générer l'accroche

source: Regenerate Teaser
fr_fr: Régénérer l'accroche

source: Summary
fr_fr: Résumé

source: Teaser
fr_fr: Accroche

source: Number of points:
fr_fr: Nombre de points :

source: Max length (% of original):
fr_fr: Longueur max (% de l'original) :

source: 0 = no limit
fr_fr: 0 = sans limite

source: Generating...
fr_fr: Génération...

source: Copy
fr_fr: Copier

source: Auto-Select Categories
fr_fr: Sélection automatique des catégories

source: Max categories:
fr_fr: Max. catégories :

source: Finding...
fr_fr: Recherche...

source: Please configure your API key in the %s.
fr_fr: Veuillez configurer votre clé API dans les %s.

source: settings
fr_fr: réglages
